import pandas as pd
import matplotlib.pyplot as plt

marks_data = {
    'Имена' : ['Андрей', 'Алексей', 'Сергей', 'Пётр', 'Александр', 'Михаил', 'Владимир', 'Степан', 'Николай', 'Вадим' ],
    'Русский язык' : [5,4,3,4,5,3,5,4,3,4],
    'География' : [4,3,5,5,3,5,4,4,5,3],
    'Математика' : [4,5,3,5,4,3,3,4,5,4],
    'Физика' : [4,4,3,3,5,5,3,4,5,3],
    'Химия' : [5,5,4,3,3,4,4,5,4,5]
}

df = pd.DataFrame(marks_data)

print(df.head())
print(df.describe())


print(f'Средняя оценка по русскому языку - {df['Русский язык'].mean()}')
print(f'Средняя оценка по географии - {df['География'].mean()}')
print(f'Средняя оценка по математике - {df['Математика'].mean()}')
print(f'Средняя оценка по физике - {df['Физика'].mean()}')
print(f'Средняя оценка по химии - {df['Химия'].mean()}')

print(f'Медианная оценка по русскому языку - {df['Русский язык'].median()}')
print(f'Медианная оценка по географии - {df['География'].median()}')
print(f'Медианная оценка по математике - {df['Математика'].median()}')
print(f'Медианная оценка по физике - {df['Физика'].median()}')
print(f'Медианная оценка по химии - {df['Химия'].median()}')

# df['Математика'].hist()
# plt.show()
# df.boxplot(column='Математика')
# plt.show()
Q1_math = df['Математика'].quantile(0.25)
Q3_math = df['Математика'].quantile(0.75)
IQR_math = Q3_math - Q1_math

print(f'Q1 оценок по математике - {Q1_math}')
print(f'Q3 оценок по математике - {Q3_math}')
print(f'IQR оценок по математике - {IQR_math}')